const faceArray = (function () {
  let faceName = ['露牙笑', '吐舌', '汗', '偷笑', '再见', '锤头', '哼哼', '猪头', '玫瑰', '大哭', '哭', '嘘', '酷', '抓狂', '委屈', '屎', '雷劈', '树叶', '腼腆', '花心', '害羞', '思考', '吐', '微笑', '发火', '汗颜', '生气', '可怜', '心', '护心', '无所谓', '狗头', '要哭了', '瞪眼', '疑问', '困', '亲亲', '大笑', '鄙视', '衰', '生病', '奸笑', '凹凸曼', '瞪眼', '右哼哼', '抱抱', '色', '晕', '啤酒炸鸡', '闭嘴', '不不不', '可怜', '赞', '踩', '握手', '耶', '抱拳', '二哈', '咖啡', '生日', '西瓜', '碰杯', '猫头', '勾引', 'OK', '爱手势', '闹钟', '钱流口水', '晚安', '兔子', '-_-', '惊讶', '小拇指', '握拳', '心碎', '太阳', '礼物', '皂', '骷髅头', '调皮', '闪电', '白眼', '瞌睡', '骂', '熊猫', '抠鼻', '鼓掌', '呸', '左哼哼', '打哈欠', '戴口罩', '神兽'];
  let arr = [];
  for (let i = 0; i < faceName.length; i++) {
    let pathIndex = 17 + i; // 图片索引
    arr.push({name: faceName[i], path: require('./img/' + pathIndex.toString().padStart(4, 'f0') + '.png')})
  }
  return arr;
})()
export default faceArray;
